apache/nuttx/arch/xtensa/src/esp32s3/hardware/esp32s3_systimer.h
#define SYSTIMER_TARGET0_HI_RO    0x000fffff
#define SYSTIMER_TARGET0_HI_RO_M  (SYSTIMER_TARGET0_HI_RO_V << SYSTIMER_TARGET0_HI_RO_S)
#define SYSTIMER_TARGET0_HI_RO_V  0x000fffff
#define SYSTIMER_TARGET0_HI_RO_S  0

/* SYSTIMER_REAL_TARGET1_LO_REG register
 * system timer comp1 actual target value low register
 */

#define SYSTIMER_REAL_TARGET1_LO_REG (DR_REG_SYSTIMER_BASE + 0x7c)

/* SYSTIMER_TARGET1_LO_RO : RO; bitpos: [31:0]; default: 0;
 * actual target value value low 32bits
 */

#define SYSTIMER_TARGET1_LO_RO    0xffffffff
#define SYSTIMER_TARGET1_LO_RO_M  (SYSTIMER_TARGET1_LO_RO_V << SYSTIMER_TARGET1_LO_RO_S)
#define SYSTIMER_TARGET1_LO_RO_V  0xffffffff
#define SYSTIMER_TARGET1_LO_RO_S  0

/* SYSTIMER_REAL_TARGET1_HI_REG register
 * system timer comp1 actual target value high register
 */

#define SYSTIMER_REAL_TARGET1_HI_REG (DR_REG_SYSTIMER_BASE + 0x80)

/* SYSTIMER_TARGET1_HI_RO : RO; bitpos: [19:0]; default: 0;
 * actual target value value high 20bits
 */

#define SYSTIMER_TARGET1_HI_RO    0x000fffff
#define SYSTIMER_TARGET1_HI_RO_M  (SYSTIMER_TARGET1_HI_RO_V << SYSTIMER_TARGET1_HI_RO_S)
#define SYSTIMER_TARGET1_HI_RO_V  0x000fffff
#define SYSTIMER_TARGET1_HI_RO_S  0

/* SYSTIMER_REAL_TARGET2_LO_REG register
 * system timer comp2 actual target value low register
 */

#define SYSTIMER_REAL_TARGET2_LO_REG (DR_REG_SYSTIMER_BASE + 0x84)

/* SYSTIMER_TARGET2_LO_RO : RO; bitpos: [31:0]; default: 0;
 * actual target value value low 32bits
 */

#define SYSTIMER_TARGET2_LO_RO    0xffffffff
#define SYSTIMER_TARGET2_LO_RO_M  (SYSTIMER_TARGET2_LO_RO_V << SYSTIMER_TARGET2_LO_RO_S)
#define SYSTIMER_TARGET2_LO_RO_V  0xffffffff
#define SYSTIMER_TARGET2_LO_RO_S  0

/* SYSTIMER_REAL_TARGET2_HI_REG register
 * system timer comp2 actual target value high register
 */

#define SYSTIMER_REAL_TARGET2_HI_REG (DR_REG_SYSTIMER_BASE + 0x88)

/* SYSTIMER_TARGET2_HI_RO : RO; bitpos: [19:0]; default: 0;
 * actual target value value high 20bits
 */

#define SYSTIMER_TARGET2_HI_RO    0x000fffff
#define SYSTIMER_TARGET2_HI_RO_M  (SYSTIMER_TARGET2_HI_RO_V << SYSTIMER_TARGET2_HI_RO_S)
#define SYSTIMER_TARGET2_HI_RO_V  0x000fffff
#define SYSTIMER_TARGET2_HI_RO_S  0

/* SYSTIMER_DATE_REG register
 * system timer version control register
 */

#define SYSTIMER_DATE_REG (DR_REG_SYSTIMER_BASE + 0xfc)

/* SYSTIMER_DATE : R/W; bitpos: [31:0]; default: 33628753;
 * systimer register version
 */

#define SYSTIMER_DATE    0xffffffff
#define SYSTIMER_DATE_M  (SYSTIMER_DATE_V << SYSTIMER_DATE_S)
#define SYSTIMER_DATE_V  0xffffffff
#define SYSTIMER_DATE_S  0

#endif /* __ARCH_XTENSA_SRC_ESP32S3_HARDWARE_ESP32S3_SYSTIMER_H */
